Oryx-Embedded/CycloneTCP/drivers/mac/stm32n6xx_eth_driver.c
/**
 * @file stm32n6xx_eth_driver.c
 * @brief STM32N6 Gigabit Ethernet MAC driver
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2026 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneTCP Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.6.2
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL NIC_TRACE_LEVEL

//Dependencies
#include "stm32n6xx.h"
#include "stm32n6xx_hal.h"
#include "core/net.h"
#include "drivers/mac/stm32n6xx_eth_driver.h"
#include "debug.h"

//Underlying network interface
static NetInterface *nicDriverInterface;

//IAR EWARM compiler?
#if defined(__ICCARM__)

//Transmit buffer
#pragma data_alignment = 4
#pragma location = STM32N6XX_ETH_RAM_SECTION
static uint8_t txBuffer[STM32N6XX_ETH_TX_BUFFER_COUNT][STM32N6XX_ETH_TX_BUFFER_SIZE];
//Receive buffer
#pragma data_alignment = 4
#pragma location = STM32N6XX_ETH_RAM_SECTION
static uint8_t rxBuffer[STM32N6XX_ETH_RX_BUFFER_COUNT][STM32N6XX_ETH_RX_BUFFER_SIZE];
//Transmit DMA descriptors
#pragma data_alignment = 8
#pragma location = STM32N6XX_ETH_RAM_SECTION
static Stm32n6xxTxDmaDesc txDmaDesc[STM32N6XX_ETH_TX_BUFFER_COUNT];
//Receive DMA descriptors
#pragma data_alignment = 8
#pragma location = STM32N6XX_ETH_RAM_SECTION
static Stm32n6xxRxDmaDesc rxDmaDesc[STM32N6XX_ETH_RX_BUFFER_COUNT];

//Keil MDK-ARM or GCC compiler?
#else

//Transmit buffer
static uint8_t txBuffer[STM32N6XX_ETH_TX_BUFFER_COUNT][STM32N6XX_ETH_TX_BUFFER_SIZE]
   __attribute__((aligned(4), __section__(STM32N6XX_ETH_RAM_SECTION)));
//Receive buffer
static uint8_t rxBuffer[STM32N6XX_ETH_RX_BUFFER_COUNT][STM32N6XX_ETH_RX_BUFFER_SIZE]
   __attribute__((aligned(4), __section__(STM32N6XX_ETH_RAM_SECTION)));
//Transmit DMA descriptors
static Stm32n6xxTxDmaDesc txDmaDesc[STM32N6XX_ETH_TX_BUFFER_COUNT]
   __attribute__((aligned(8), __section__(STM32N6XX_ETH_RAM_SECTION)));
//Receive DMA descriptors
static Stm32n6xxRxDmaDesc rxDmaDesc[STM32N6XX_ETH_RX_BUFFER_COUNT]
   __attribute__((aligned(8), __section__(STM32N6XX_ETH_RAM_SECTION)));

#endif

//Current transmit descriptor
static uint_t txIndex;
//Current receive descriptor
static uint_t rxIndex;


/**
 * @brief STM32N6 Ethernet MAC driver
 **/

const NicDriver stm32n6xxEthDriver =
{
   NIC_TYPE_ETHERNET,
   ETH_MTU,
   stm32n6xxEthInit,
   stm32n6xxEthTick,
   stm32n6xxEthEnableIrq,
   stm32n6xxEthDisableIrq,
   stm32n6xxEthEventHandler,
   stm32n6xxEthSendPacket,
   stm32n6xxEthUpdateMacAddrFilter,
   stm32n6xxEthUpdateMacConfig,
   stm32n6xxEthWritePhyReg,
   stm32n6xxEthReadPhyReg,
   TRUE,
   TRUE,
   TRUE,
   FALSE
};


/**
 * @brief STM32N6 Ethernet MAC initialization
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t stm32n6xxEthInit(NetInterface *interface)
{
   error_t error;
   uint32_t temp;

   //Debug message
   TRACE_INFO("Initializing STM32N6 Ethernet MAC...\r\n");

   //Save underlying network interface
   nicDriverInterface = interface;

   //GPIO configuration
   stm32n6xxEthInitGpio(interface);

   //Enable Ethernet MAC clock
   __HAL_RCC_ETH1_CLK_ENABLE();
   __HAL_RCC_ETH1MAC_CLK_ENABLE();
   __HAL_RCC_ETH1TX_CLK_ENABLE();
   __HAL_RCC_ETH1RX_CLK_ENABLE();

   //Reset Ethernet MAC peripheral
   __HAL_RCC_ETH1_FORCE_RESET();
   __HAL_RCC_ETH1_RELEASE_RESET();

   //Perform a software reset
   ETH1->DMAMR |= ETH_DMAMR_SWR;
   //Wait for the reset to complete
   while((ETH1->DMAMR & ETH_DMAMR_SWR) != 0)
   {
   }

   //Adjust MDC clock range depending on HCLK frequency
   ETH1->MACMDIOAR = ETH_MACMDIOAR_CR_Val(5);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Ethernet PHY initialization
      error = interface->phyDriver->init(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Ethernet switch initialization
      error = interface->switchDriver->init(interface);
   }
   else
   {
      //The interface is not properly configured
      error = ERROR_FAILURE;
   }

   //Any error to report?
   if(error)
   {
      return error;
   }

   //Use default MAC configuration
   ETH1->MACCR = ETH_MACCR_GPSLCE | ETH_MACCR_DO;

   //Set the maximum packet size that can be accepted
   temp = ETH1->MACECR & ~ETH_MACECR_GPSL;
   ETH1->MACECR = temp | STM32N6XX_ETH_RX_BUFFER_SIZE;

   //Configure MAC address filtering
   stm32n6xxEthUpdateMacAddrFilter(interface);

   //Disable flow control
   ETH1->MACQ0TXFCR = 0;
   ETH1->MACRXFCR = 0;

   //Enable the first RX queue
   ETH1->MACRXQC0R = ETH_MACRXQC0R_RXQ0EN_Val(2);

   //Configure DMA operating mode
   ETH1->DMAMR = ETH_DMAMR_INTM_Val(0) | ETH_DMAMR_TXPR_Val(0);
   //Configure system bus mode
   ETH1->DMASBMR |= ETH_DMASBMR_AAL;

   //The DMA takes the descriptor table as contiguous
   ETH1->DMA_CH[0].DMACCR = ETH_DMACxCR_DSL_Val(0);
   //Configure TX features
   ETH1->DMA_CH[0].DMACTXCR = ETH_DMACxTXCR_TXPBL_Val(32);

   //Configure RX features
   ETH1->DMA_CH[0].DMACRXCR = ETH_DMACxRXCR_RXPBL_Val(32) |
      ETH_DMACxRXCR_RBSZ_Val(STM32N6XX_ETH_RX_BUFFER_SIZE);

   //Enable store and forward mode for transmission
   ETH1->MTL_QUEUE[0].MTLTXQOMR = ETH_MTLTXQxOMR_TQS_Val(7) | ETH_MTLTXQxOMR_TXQEN_Val(2) |
      ETH_MTLTXQxOMR_TSF;

   //Enable store and forward mode for reception
   ETH1->MTL_QUEUE[0].MTLRXQOMR = ETH_MTLRXQxOMR_RQS_Val(7) | ETH_MTLRXQxOMR_RSF;

   //Initialize DMA descriptor lists
   stm32n6xxEthInitDmaDesc(interface);

