Oryx-Embedded/CycloneTCP/drivers/mac/stm32n6xx_eth_driver.c
   //Prevent interrupts from being generated when the transmit statistic
   //counters reach half their maximum value
   ETH1->MMCTIMR = ETH_MMCTIMR_TXLPITRCIM | ETH_MMCTIMR_TXLPIUSCIM |
      ETH_MMCTIMR_TXGPKTIM | ETH_MMCTIMR_TXMCOLGPIM | ETH_MMCTIMR_TXSCOLGPIM;

   //Prevent interrupts from being generated when the receive statistic
   //counters reach half their maximum value
   ETH1->MMCRIMR = ETH_MMCRIMR_RXLPITRCIM | ETH_MMCRIMR_RXLPIUSCIM |
      ETH_MMCRIMR_RXUCGPIM | ETH_MMCRIMR_RXALGNERPIM | ETH_MMCRIMR_RXCRCERPIM;

   //Disable MAC interrupts
   ETH1->MACIER = 0;
   //Enable the desired DMA interrupts
   ETH1->DMA_CH[0].DMACIER = ETH_DMACxIER_NIE | ETH_DMACxIER_RIE | ETH_DMACxIER_TIE;

   //Set priority grouping (4 bits for pre-emption priority, no bits for subpriority)
   NVIC_SetPriorityGrouping(STM32N6XX_ETH_IRQ_PRIORITY_GROUPING);

   //Configure Ethernet interrupt priority
   NVIC_SetPriority(ETH1_IRQn, NVIC_EncodePriority(STM32N6XX_ETH_IRQ_PRIORITY_GROUPING,
      STM32N6XX_ETH_IRQ_GROUP_PRIORITY, STM32N6XX_ETH_IRQ_SUB_PRIORITY));

   //Enable MAC transmission and reception
   ETH1->MACCR |= ETH_MACCR_TE | ETH_MACCR_RE;

   //Enable DMA transmission and reception
   ETH1->DMA_CH[0].DMACTXCR |= ETH_DMACxTXCR_ST;
   ETH1->DMA_CH[0].DMACRXCR |= ETH_DMACxRXCR_SR;

   //Accept any packets from the upper layer
   osSetEvent(&interface->nicTxEvent);

   //Successful initialization
   return NO_ERROR;
}


/**
 * @brief GPIO configuration
 * @param[in] interface Underlying network interface
 **/

__weak_func void stm32n6xxEthInitGpio(NetInterface *interface)
{
//Nucleo-N657X0-Q evaluation board?
#if defined(USE_STM32N6xx_NUCLEO)
   GPIO_InitTypeDef GPIO_InitStructure;

   //Enable GPIO clocks
   __HAL_RCC_GPIOF_CLK_ENABLE();
   __HAL_RCC_GPIOG_CLK_ENABLE();

   //Select RMII interface mode
   SET_BIT(RCC->CCIPR2, RCC_ETH1PHYIF_RMII);

   //Configure RMII pins
   GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
   GPIO_InitStructure.Pull = GPIO_NOPULL;
   GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
   GPIO_InitStructure.Alternate = GPIO_AF11_ETH1;

   //Configure ETH1_MDIO (PF4), ETH1_RMII_REF_CLK (PF7),
   //ETH1_RMII_CRS_DV (PF10), ETH1_RMII_TX_EN (PF11), ETH1_RMII_TXD0 (PF12),
   //ETH1_RMII_TXD1 (PF13), ETH1_RMII_RXD0 (PF14) and ETH1_RMII_RXD1 (PF15)
   GPIO_InitStructure.Pin = GPIO_PIN_4 | GPIO_PIN_7 | GPIO_PIN_10 |
      GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
   HAL_GPIO_Init(GPIOF, &GPIO_InitStructure);

   //Configure ETH1_MDC (PG11), 
   GPIO_InitStructure.Pin = GPIO_PIN_11;
   HAL_GPIO_Init(GPIOG, &GPIO_InitStructure);

//STM32N6570-DK evaluation board?
#elif defined(USE_STM32N6570_DK)
   GPIO_InitTypeDef GPIO_InitStructure;
   GPIO_DelayTypeDef GPIO_DelayStructure;

   //Enable GPIO clocks
   __HAL_RCC_GPIOD_CLK_ENABLE();
   __HAL_RCC_GPIOF_CLK_ENABLE();
   __HAL_RCC_GPIOG_CLK_ENABLE();

   //Select RGMII interface mode
   SET_BIT(RCC->CCIPR2, RCC_ETH1PHYIF_RGMII);

   //Configure RGMII pins
   GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
   GPIO_InitStructure.Pull = GPIO_NOPULL;
   GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
   GPIO_InitStructure.Alternate = GPIO_AF11_ETH1;

   //Configure ETH1_MDC (PD1) and ETH1_MDIO (PD12)
   GPIO_InitStructure.Pin = GPIO_PIN_1 | GPIO_PIN_12;
   HAL_GPIO_Init(GPIOD, &GPIO_InitStructure);

   //Configure ETH1_RGMII_CLK125 (PF2), ETH1_RGMII_RX_CLK (PF7),
   //ETH1_RGMII_RXD2 (PF8), ETH1_RGMII_RXD3 (PF9), ETH1_RGMII_RX_CTL (PF10),
   //ETH1_RGMII_TX_CTL (PF11), ETH1_RGMII_TXD0 (PF12), ETH1_RMII_TXD1 (PF13),
   //ETH1_RGMII_RXD0 (PF14) and ETH1_RGMII_RXD1 (PF15)
   GPIO_InitStructure.Pin = GPIO_PIN_2 | GPIO_PIN_7 | GPIO_PIN_8 | GPIO_PIN_9 |
      GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 |
      GPIO_PIN_15;
   HAL_GPIO_Init(GPIOF, &GPIO_InitStructure);

   //Configure ETH1_RGMII_TXD2 (PG3) and ETH1_RGMII_TXD3 (PG4)
   GPIO_InitStructure.Pin = GPIO_PIN_3 | GPIO_PIN_4;
   HAL_GPIO_Init(GPIOG, &GPIO_InitStructure);

   //Configure ETH1_RGMII_GTX_CLK (PF0)
   GPIO_InitStructure.Pin = GPIO_PIN_0;
   GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_MEDIUM;
   GPIO_InitStructure.Alternate = GPIO_AF12_ETH1;
   HAL_GPIO_Init(GPIOF, &GPIO_InitStructure);

   //Configure GPIO delay on ETH1_RGMII_RX_CLK (PF7)
   GPIO_DelayStructure.Delay = GPIO_DELAY_PS_500;
   GPIO_DelayStructure.Path = GPIO_PATH_IN;
   HAL_GPIO_SetDelay(GPIOF, GPIO_PIN_7, &GPIO_DelayStructure);
#endif
}


/**
 * @brief Initialize DMA descriptor lists
 * @param[in] interface Underlying network interface
 **/

void stm32n6xxEthInitDmaDesc(NetInterface *interface)
{
   uint_t i;

   //Initialize TX DMA descriptor list
   for(i = 0; i < STM32N6XX_ETH_TX_BUFFER_COUNT; i++)
   {
      //The descriptor is initially owned by the application
      txDmaDesc[i].tdes0 = 0;
      txDmaDesc[i].tdes1 = 0;
      txDmaDesc[i].tdes2 = 0;
      txDmaDesc[i].tdes3 = 0;
   }

   //Initialize TX descriptor index
   txIndex = 0;

   //Initialize RX DMA descriptor list
   for(i = 0; i < STM32N6XX_ETH_RX_BUFFER_COUNT; i++)
   {
      //The descriptor is initially owned by the DMA
      rxDmaDesc[i].rdes0 = (uint32_t) rxBuffer[i];
      rxDmaDesc[i].rdes1 = 0;
      rxDmaDesc[i].rdes2 = 0;
      rxDmaDesc[i].rdes3 = ETH_RDES3_OWN | ETH_RDES3_IOC | ETH_RDES3_BUF1V;
   }

   //Initialize RX descriptor index
   rxIndex = 0;

   //Start location of the TX descriptor list
   ETH1->DMA_CH[0].DMACTXDLAR = (uint32_t) &txDmaDesc[0];
   //Length of the transmit descriptor ring
   ETH1->DMA_CH[0].DMACTXRLR = STM32N6XX_ETH_TX_BUFFER_COUNT - 1;

   //Start location of the RX descriptor list
   ETH1->DMA_CH[0].DMACRXDLAR = (uint32_t) &rxDmaDesc[0];
   //Length of the receive descriptor ring
   ETH1->DMA_CH[0].DMACRXRLR = STM32N6XX_ETH_RX_BUFFER_COUNT - 1;
}


/**
 * @brief STM32N6 Ethernet MAC timer handler
 *
 * This routine is periodically called by the TCP/IP stack to handle periodic
 * operations such as polling the link state
 *
 * @param[in] interface Underlying network interface
 **/

void stm32n6xxEthTick(NetInterface *interface)
{
   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Handle periodic operations
      interface->phyDriver->tick(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Handle periodic operations
      interface->switchDriver->tick(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief Enable interrupts
 * @param[in] interface Underlying network interface
 **/

